test/stubs/create_shipment_order_international_packet_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:bcs="http://dhl.de/webservices/businesscustomershipping" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cis="http://dhl.de/webservice/cisbase">
  <env:Header>
    <cis:Authentification>
      <cis:user>2222222222_01</cis:user>
      <cis:signature>pass</cis:signature>
      <cis:type>0</cis:type>
    </cis:Authentification>
  </env:Header>
  <env:Body>
    <bcs:CreateShipmentOrderRequest>
      <bcs:Version>
        <majorRelease>2</majorRelease>
        <minorRelease>0</minorRelease>
      </bcs:Version>
      <ShipmentOrder>
        <sequenceNumber>01</sequenceNumber>
        <Shipment>
          <ShipmentDetails>
            <product>V53WPAK</product>
            <shipmentDate>2018-04-18</shipmentDate>
            <cis:accountNumber>22222222225301</cis:accountNumber>
            <ShipmentItem>
              <weightInKG>3.5</weightInKG>
            </ShipmentItem>
          </ShipmentDetails>
          <Shipper>
            <Name>
              <cis:name1>Christoph Wagner</cis:name1>
              <cis:name2>webit!</cis:name2>
            </Name>
            <Address>
              <cis:streetName>Schandauer Straße</cis:streetName>
              <cis:streetNumber>34</cis:streetNumber>
              <cis:zip>01309</cis:zip>
              <cis:city>Dresden</cis:city>
              <cis:Origin>
                <cis:countryISOCode>DE</cis:countryISOCode>
              </cis:Origin>
            </Address>
            <Communication>
              <cis:email>wagner@webit.de</cis:email>
            </Communication>
          </Shipper>
          <Receiver>
            <cis:name1>Jane Doe</cis:name1>
            <Communication>
              <cis:email>jane.doe@example.com</cis:email>
            </Communication>
            <Address>
              <cis:streetName>Bleicherweg</cis:streetName>
              <cis:streetNumber>5</cis:streetNumber>
              <cis:zip>8001</cis:zip>
              <cis:city>Zürich</cis:city>
              <cis:Origin>
                <cis:countryISOCode>CH</cis:countryISOCode>
              </cis:Origin>
            </Address>
          </Receiver>
          <ExportDocument>
            <invoiceNumber>12345678</invoiceNumber>
            <exportType>OTHER</exportType>
            <exportTypeDescription>Permanent</exportTypeDescription>
            <termsOfTrade>DDP</termsOfTrade>
            <placeOfCommital>Bonn</placeOfCommital>
            <permitNumber>1234</permitNumber>
            <attestationNumber>12345678</attestationNumber>
            <WithElectronicExportNtfctn active="1" />
            <ExportDocPosition>
              <description>ExportPositionOne</description>
              <countryCodeOrigin>CN</countryCodeOrigin>
              <customsTariffNumber>12345678</customsTariffNumber>
              <amount>1</amount>
              <netWeightInKG>0.2</netWeightInKG>
              <customsValue>24.96</customsValue>
            </ExportDocPosition>
            <ExportDocPosition>
              <description>ExportPositionTwo</description>
              <countryCodeOrigin>CN</countryCodeOrigin>
              <customsTariffNumber>12345678</customsTariffNumber>
              <amount>1</amount>
              <netWeightInKG>0.4</netWeightInKG>
              <customsValue>99.9</customsValue>
            </ExportDocPosition>
          </ExportDocument>
        </Shipment>
        <LabelResponseType>URL</LabelResponseType>
      </ShipmentOrder>
    </bcs:CreateShipmentOrderRequest>
  </env:Body>
</env:Envelope>
